In [1]:
from pymongo import MongoClient
import pandas as pd
import json
import geojson
import os
import requests
from dotenv import load_dotenv
import time
import geopandas as gpd
from cartoframes.viz import Map, Layer, popup_element

## VISUALIZING ##

**IMPORTING JSON INTO DF**

    SAN FRANCISCO

Posar-ho en funcio, afegir train stations, and airports

In [2]:
client = MongoClient("localhost:27017")
db = client["project_3"]

In [5]:
SFstarbucks = pd.DataFrame(list(db.SFstarbucks.find()))
SFstarbucks.sample()

                        _id       name        lat         lon
3  6546afef716a854e3d9692e3  Starbucks  37.788706 -122.279538

In [6]:
SFschools = pd.DataFrame(list(db.SFschools.find()))
SFschools.sample()

,_id,name,lat,lon
43,6546aff1716a854e3d969317,San Miguel Elementary School,37.391484,-122.008433

In [7]:
SFpet_grooming = pd.DataFrame(list(db.SFpet_grooming.find()))
SFpet_grooming.sample()

,_id,name,lat,lon
48,6546aff3716a854e3d96934e,San Bruno Dog Obedience School,37.616007,-122.435966

In [8]:
SFdog_parks = pd.DataFrame(list(db.SFdog_parks.find()))
SFdog_parks.sample()

,_id,name,lat,lon
27,6546aff4716a854e3d96936b,OAK Smoking Area / Animal Relief Area,37.711441,-122.210758

In [9]:
SFbars_clubs = pd.DataFrame(list(db.SFbars_clubs.find()))
SFbars_clubs.sample()

                         _id         name        lat         lon
43  6546aff5716a854e3d9693ad  True Laurel  37.759466 -122.411421

In [10]:
SFvegan_vegetarian = pd.DataFrame(list(db.SFvegan_vegetarian.find()))
SFvegan_vegetarian.sample()

                         _id         name        lat         lon
16  6546aff6716a854e3d9693c4  Señor Sisig  37.805386 -122.267155

    NEW YORK

In [11]:
NYCstarbucks = pd.DataFrame(list(db.NYCstarbucks.find()))
NYCstarbucks.sample()

                         _id       name        lat        lon
13  6546aff8716a854e3d9693f3  Starbucks  40.780038 -73.959593

In [25]:
NYCschools = pd.DataFrame(list(db.NYCschools.find()))
NYCschools.sample()

,_id,name,lat,lon
41,6546affc716a854e3d96941d,West Belmar Elementary School,40.172224,-74.03443

In [26]:
NYCtrain_stations = pd.DataFrame(list(db.NYCtrain_stations.find()))
NYCtrain_stations.sample()

                        _id                     name        lat        lon
0  6546affe716a854e3d969426  Whippany Railway Museum  40.819949 -74.373455

In [27]:
NYCpet_grooming = pd.DataFrame(list(db.NYCpet_grooming.find()))
NYCpet_grooming.sample()

                        _id        name        lat        lon
0  6546b001716a854e3d969427  Happy Paws  40.725387 -73.995331

In [28]:
NYCdog_parks = pd.DataFrame(list(db.NYCdog_parks.find()))
NYCdog_parks.sample()

,_id,name,lat,lon
9,6546b002716a854e3d969462,Riverside Park South Dog Run,40.781258,-73.986476

In [29]:
NYCbars_clubs = pd.DataFrame(list(db.NYCbars_clubs.find()))
NYCbars_clubs.sample()

                         _id          name        lat        lon
44  6546b004716a854e3d9694b7  The Red Lion  40.728514 -73.999384

In [30]:
NYCvegan_vegetarian = pd.DataFrame(list(db.NYCvegan_vegetarian.find()))
NYCvegan_vegetarian.sample()

                         _id        name        lat        lon
17  6546b005716a854e3d9694ce  Sweetgreen  40.726286 -74.007896

    SEATTLE

In [31]:
STstarbucks = pd.DataFrame(list(db.STstarbucks.find()))
STstarbucks.sample()

                         _id       name        lat         lon
16  6546b006716a854e3d9694ff  Starbucks  47.630006 -122.340025

In [32]:
STschools = pd.DataFrame(list(db.STschools.find()))
STschools.sample()

,_id,name,lat,lon
7,6546b008716a854e3d96950e,Mountlake Terrace High School,47.801813,-122.288125

In [33]:
STpet_grooming = pd.DataFrame(list(db.STpet_grooming.find()))
STpet_grooming.sample()

                         _id             name       lat         lon
49  6546b00a716a854e3d96956a  Elite Pet Salon  47.31877 -122.589273

In [34]:
STdog_parks = pd.DataFrame(list(db.STdog_parks.find()))
STdog_parks.sample()

,_id,name,lat,lon
16,6546b00b716a854e3d96957b,Edith Moulton Off-Leash Area,47.72344,-122.194079

In [35]:
STbars_clubs = pd.DataFrame(list(db.STbars_clubs.find()))
STbars_clubs.sample()

                         _id                     name        lat         lon
30  6546b00d716a854e3d9695bb  Lost Lake Cafe & Lounge  47.614302 -122.319659

In [36]:
STvegan_vegetarian = pd.DataFrame(list(db.STvegan_vegetarian.find()))
STvegan_vegetarian.sample()

                         _id          name       lat         lon
12  6546b00e716a854e3d9695db  Square Lotus  47.57925 -122.167448

Funcion para pins de cada tipo, despues llamar a estas funciones cuando se hace el mapa para tener todos los pins.